Documents/РозподілЗБЛічильникаГВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>РозподілЗБЛічильникаГВ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.РаспределениеГорячейВоды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОбщедомовое</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаСоСчетчиками</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеРаспределенияПрошлогоМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флДополнительныйПриборУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Энергоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Тарифы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНормеЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РозподілЗБЛічильникаГВ/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРИ - ОБРОБНИКИ ПОДІЙ ФОРМИ

//Процедура - обробник події При створенні на сервері
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "uk = ""Л=uk_UA;ДФ='MMMM yyyy'""; uk = ""Л=uk_UA;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// Додаткові Звіти І Обробки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Кінець Додаткові Звіти І Обробки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
	Если Объект.флДополнительныйПриборУчета = Ложь Тогда
		Элементы.ДопПриборУчета.Видимость = Ложь;
	Иначе
		Элементы.ДопПриборУчета.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура – обробник події ПісляЗапису.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);

КонецПроцедуры

// Процедура - обробник події при читанні на сервері.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	Если Объект.флДополнительныйПриборУчета = Ложь Тогда
		Элементы.ДопПриборУчета.Видимость = Ложь;
	Иначе
		Элементы.ДопПриборУчета.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРИ ТА ФУНКЦІЇ ЗАГАЛЬНОГО ПРИЗНАЧЕННЯ

&НаСервере
Процедура ЗаполнитьНаСервере()
	РасчитыватьЭнергоемкость = Объект.Услуга.РасчитыватьЭнергоемкость;
	Если НЕ ЗначениеЗаполнено(Объект.УслугаСоСчетчиками) Тогда
		Сообщить("Не заповнена послуга з лічильниками!");
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(УслугаБезСчетчиков) Тогда
		Сообщить("Не заповнена послуга без лічильників!");
		Возврат;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки КАК ЛицевойСчет,
			|	СУММА(РасчетПоказанийПриборовУчетаОбороты.ЗначениеПриход) КАК Значение,
			|	РасчетПоказанийПриборовУчетаОбороты.Период
			|ИЗ
			|	РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(
			|			&НачПериода,
			|			&КонПериода,
			|			Месяц,
			|			Услуга = &Услуга
			|				И ОбъектУстановки.Владелец = &Здание) КАК РасчетПоказанийПриборовУчетаОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки,
			|	РасчетПоказанийПриборовУчетаОбороты.Период";
		Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.НачПериода));
		Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.КонПериода));		
		Запрос.УстановитьПараметр("Услуга", 	Объект.УслугаСоСчетчиками);
		Запрос.УстановитьПараметр("Здание",     Объект.Здание);
		
		ТаблицаУслугСоСчетчиками = Запрос.Выполнить().Выгрузить();
		ЗначениеСоСчетчиками     = ТаблицаУслугСоСчетчиками.Итог("Значение");
		ТаблицаУслугСоСчетчиками.Колонки.Добавить("Показание", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
	    ТаблицаУслугСоСчетчиками.Колонки.Добавить("ЗначениеБазыСКоэффициентом", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
		
		
		// Выбор услуг без приборов учета		
		Запрос = Новый Запрос;
		Запрос.Текст = 			
		//	  "ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	  |	0 КАК ИндексНабора,
		//	  |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
		//	  |	НазначенныеУслугиСрезПоследних.Организация,
		//	  |	НазначенныеУслугиСрезПоследних.Действует,
		//	  |	НазначенныеУслугиСрезПоследних.Услуга,
		//	  |	НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги,
		//	  |	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец КАК Здание,
		//	  |	НазначенныеУслугиСрезПоследних.Период КАК ДатаНачалаДействия,
		//	  |	МАКСИМУМ(НазначенныеУслуги.Период) КАК ДатаОкончанияДействия,
		//	  |	НазначенныеУслугиСрезПоследних.Регистратор КАК РегистраторДействующих
		//	  |ИЗ
		//	  |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
		//	  |			&Период,
		//	  |			Действует
		//	  |				И ЛицевойСчет.Владелец = &Здание
		//	  |				И Организация = &Организация
		//	  |				И Услуга В (&Услуга)) КАК НазначенныеУслугиСрезПоследних
		//	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенныеУслуги КАК НазначенныеУслуги
		//	  |		ПО НазначенныеУслугиСрезПоследних.Организация = НазначенныеУслуги.Организация
		//	  |			И НазначенныеУслугиСрезПоследних.ЛицевойСчет = НазначенныеУслуги.ЛицевойСчет
		//	  |			И НазначенныеУслугиСрезПоследних.Услуга = НазначенныеУслуги.Услуга
		//	  |			И (НазначенныеУслуги.Действует = ЛОЖЬ)
		//	  |			И (НазначенныеУслуги.Период > &Период)
		//	  |
		//	  |СГРУППИРОВАТЬ ПО
		//	  |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
		//	  |	НазначенныеУслугиСрезПоследних.Организация,
		//	  |	НазначенныеУслугиСрезПоследних.Действует,
		//	  |	НазначенныеУслугиСрезПоследних.Услуга,
		//	  |	НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги,
		//	  |	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец,
		//	  |	НазначенныеУслугиСрезПоследних.Период,
		//	  |	НазначенныеУслугиСрезПоследних.Регистратор";
		//	
		//	

		//Запрос.УстановитьПараметр("Период",	     КонецМесяца(Объект.КонПериода));
		//Запрос.УстановитьПараметр("Здание",      Объект.Здание);
		//Запрос.УстановитьПараметр("Организация", Объект.Организация);
		//Запрос.УстановитьПараметр("Услуга",      УслугаБезСчетчиков);
		
		"ВЫБРАТЬ
		|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
		|	НазначенныеУслугиСрезПоследних.Действует,
		|	НазначенныеУслугиСрезПоследних.Период,
		|	МАКСИМУМ(НазначенныеУслугиСрезПоследних.Период) КАК ДатаОкончанияДействия,
		|	НазначенныеУслугиСрезПоследних.Услуга
		|ИЗ
		|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
		|			&НаДату,
		|			ЛицевойСчет.Владелец = &Здание
		|				И Организация = &Организация
		|				И Услуга В (&Услуга)) КАК НазначенныеУслугиСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
		|	НазначенныеУслугиСрезПоследних.Организация,
		|	НазначенныеУслугиСрезПоследних.Действует,
		|	НазначенныеУслугиСрезПоследних.Услуга,
		|	НазначенныеУслугиСрезПоследних.Период,
		|	НазначенныеУслугиСрезПоследних.Регистратор";
		
		Запрос.УстановитьПараметр("НаДату",      КонецМесяца(Объект.ПериодНачисления));
		Запрос.УстановитьПараметр("Здание",      Объект.Здание);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Услуга",      УслугаБезСчетчиков);
		
		ТаблицаУслугБезСчетчиков = Запрос.Выполнить().Выгрузить();
		ТаблицаУслугБезСчетчиков.Колонки.Добавить("Показание", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
		ТаблицаУслугБезСчетчиков.Колонки.Добавить("ЗначениеБазыСКоэффициентом", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
		ТаблицаУслугБезСчетчиков.Колонки.Добавить("КвоПроживающих", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2, 0)));
		
		Если ТаблицаУслугБезСчетчиков.Количество() <> 0 Тогда
			ЗначениеКубовПоНорме = 0;
			ЗначениеДляРаспределения  = Объект.ЗначениеОбщедомовое - ЗначениеСоСчетчиками;
			КонецПериодаРаспределения = КонецМесяца(Объект.КонПериода);
			НачалоПериодаРаспределения = НачалоМесяца(Объект.НачПериода);    
			КвоДнейУслуги = День(Объект.КонПериода) - День(Объект.НачПериода) + 1; // Количество дней сколько надавалась услуга 
			КвоДнейВМесяце = День(КонецМесяца(Объект.КонПериода));
			Для Каждого Строка Из ТаблицаУслугБезСчетчиков Цикл
				Если Строка.Действует = Истина Тогда
					ЗначениеНормы  = ОпределениеЗначениеНормы(Строка.Услуга, Строка.ЛицевойСчет.Владелец, Строка.ЛицевойСчет);
					КвоПроживающих = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Строка.ЛицевойСчет);  //КоличествоПроживающих
					ЗначениеКубовПоНорме = ЗначениеКубовПоНорме + (ЗначениеНормы * КвоПроживающих.КоличествоПроживающих * КвоДнейУслуги / КвоДнейВМесяце); 
					Строка.КвоПроживающих = КвоПроживающих.КоличествоПроживающих;
					КоэффициентПоДням = День(Объект.НачПериода)/День(Объект.КонПериода);
					Строка.ЗначениеБазыСКоэффициентом  = КвоПроживающих.КоличествоПроживающих * КоэффициентПоДням;
				КонецЕсли;
			КонецЦикла;
			ЗначениеДляРаспределения = ЗначениеДляРаспределения - ЗначениеКубовПоНорме; 
 			ИтогБазы = ТаблицаУслугБезСчетчиков.Итог("ЗначениеБазыСКоэффициентом");
			Если ИтогБазы = 0 Тогда
				Сообщить(НСтр("ru='Итог по площади равен нулю.';uk='Підсумок по площі дорівнює нулю.'"));
				Возврат;
			КонецЕсли;
			
			Для Каждого стр Из ТаблицаУслугБезСчетчиков Цикл
				Если стр.Действует = Истина Тогда
					НоваяСтрока = Объект.Основная.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
					НоваяСтрока.ОбъектЛицевогоСчета = стр.ЛицевойСчет.ОбъектЛицевогоСчета;
					НоваяСтрока.ОтветственныйВладелец = ОпределитьответственныйВладелец(стр.ЛицевойСчет);
					КоэффициентПоДням = День(Объект.НачПериода)/День(Объект.КонПериода);// определим весь месяц или только часть его оказывалась услуга в %
					НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
					НоваяСтрока.Показание = ЗначениеДляРаспределения * (стр.ЗначениеБазыСКоэффициентом / ИтогБазы);   //ТаблицаУслугБезСчетчиков.Итог("КвоПроживающих")
					Если РасчитыватьЭнергоемкость Тогда
						НоваяСтрока.Энергоемкость = НоваяСтрока.Показание/Строка.ЗначениеБазы;
					Иначе
						НоваяСтрока.Энергоемкость = 0;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если Объект.Основная.Количество()> 0 Тогда
			    ГСЧ = Новый ГенераторСлучайныхЧисел();
				СЧ = ГСЧ.СлучайноеЧисло(0,  Объект.Основная.Количество() - 1);

				ЗначениеКорректировки = Объект.Основная.Итог("Показание") - ЗначениеДляРаспределения;	
			    Объект.Основная[СЧ].Показание = Объект.Основная[СЧ].Показание - ЗначениеКорректировки;		
			КонецЕсли;
		Иначе
			//НачислениеПоСреднему = ОпределитьСредннеНачисление(Объект.Здание);
			//Если НачислениеПоСреднему.Количество() <> 0 Тогда
			//	Для Каждого стр Из НачислениеПоСреднему Цикл
			//		Отбор = Новый Структура;
			//		Отбор.Вставить("ЛицевойСчет", стр.ЛицевойСчет);
			//		Отбор.Вставить("Период", НачалоМесяца(стр.Период));
			//		ЗначениеПоСчетчику = ТаблицаУслугСоСчетчиками.НайтиСтроки(Отбор);
			//		Для Каждого стрТаб Из ЗначениеПоСчетчику Цикл
			//			стрТаб.Значение = 0;
			//			стрТаб.Значение = стр.Разница * Объект.КоеффициентРаспределения;
			//		КонецЦикла;
			//	КонецЦикла;
			//КонецЕсли;
			
			ЗначениеСоСчетчиками = ТаблицаУслугСоСчетчиками.Итог("Значение");
			
			ЗначениеДляРаспределения   = Объект.ЗначениеОбщедомовое - ЗначениеСоСчетчиками;
			Если ЗначениеДляРаспределения <= 0 Тогда
				Сообщить("Різниця між показником загальнобудинкового лічильника - " + Объект.ЗначениеОбщедомовое + ", і сумою показників по лічильниках абонентів - " + ЗначениеСоСчетчиками + " менше, або дорівнює 0. Розподіляти нічого!");
				Возврат;
			КонецЕсли;
			Значение = ЗначениеДляРаспределения / ЗначениеСоСчетчиками;
			КонецПериодаРаспределения = КонецМесяца(Объект.КонПериода);
			Для Каждого Строка Из ТаблицаУслугСоСчетчиками Цикл
				КвоПроживающих = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Строка.ЛицевойСчет);  //КоличествоПроживающих
				КоэффициентПоДням = День(Строка.Период)/День(КонецПериодаРаспределения);
				Строка.ЗначениеБазыСКоэффициентом  = КвоПроживающих.КоличествоПроживающих * КоэффициентПоДням; 	
			КонецЦикла;
			
			Для Каждого стр Из ТаблицаУслугСоСчетчиками Цикл
				НоваяСтр = Объект.Основная.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
				НоваяСтр.ОбъектЛицевогоСчета = стр.ЛицевойСчет.ОбъектЛицевогоСчета;
				НоваяСтр.ОтветственныйВладелец = ОпределитьответственныйВладелец(стр.ЛицевойСчет);
				НоваяСтр.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				НоваяСтр.Показание = стр.Значение * Значение;
			КонецЦикла;
			Если Объект.Основная.Количество()> 0 Тогда
			    ГСЧ = Новый ГенераторСлучайныхЧисел();
				СЧ = ГСЧ.СлучайноеЧисло(0,  Объект.Основная.Количество() - 1);

				ЗначениеКорректировки = Объект.Основная.Итог("Показание") - ЗначениеДляРаспределения;	
			    Объект.Основная[СЧ].Показание = Объект.Основная[СЧ].Показание - ЗначениеКорректировки;		
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОпределениеЗначениеНормы(Услуга, Здание, ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ТарифыСрезПоследних.Услуга,
	    |	ТарифыСрезПоследних.ЗначениеТарифа,
	    |	ТарифыСрезПоследних.НормаПотребления,
	    |	ТарифыСрезПоследних.ЗначениеТарифаПоНорме,
	    |	ВЫБОР
	    |		КОГДА ТарифыСрезПоследних.НормаПотребления <> 0
	    |			ТОГДА ""residentsNumber""
	    |		ИНАЧЕ Неопределено
	    |	КОНЕЦ КАК CHARACTERISTIC_TYPE
	    |ИЗ
	    |	РегистрСведений.Тарифы.СрезПоследних(
	    |			&НаДату,
	    |			Услуга = &Услуга
	    |				И Здание = &Здание) КАК ТарифыСрезПоследних";
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("Здание", Здание);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Норма = Выборка.НормаПотребления;
	КонецЦикла;
	Возврат Норма;
КонецФункции

&НаСервере
Функция ОпределитьответственныйВладелец(ЛицевойСчет)
    Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
	    |ИЗ
	    |	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&НаДату, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Владелец = Выборка.ОтветственныйВладелец;
	КонецЦикла;
	Возврат Владелец;
КонецФункции


//Процедура – обробник команди Заповнити.
//
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед зміною періоду таблична частина буде очищена. Продовжити?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	ЗаполнитьНаСервере();
КонецПроцедуры

// Процедура - обробник події Під час зміни поля введення "ПеріодНарахування".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияПриИзменении(Элемент)
	ЭтаФорма.Объект.ПериодНачисления = КонецМесяца(ЭтаФорма.Объект.ПериодНачисления);
	ФорматнаяСтрока = "uk = ""Л=uk_UA;ДФ='MMMM yyyy'""; uk = ""Л=uk_UA;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
КонецПроцедуры

// Процедура - обробник події Початок вибору поля введення "ПеріодНарахування".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед зміною періоду таблична частина буде очищена. Продовжити?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ПериодНачисления= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ПериодНачисления));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.ПериодНачисления = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
КонецПроцедуры

// Процедура - обробник події Регулювання поля "ПеріодНарахування".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед зміною періоду таблична частина буде очищена. Продовжити?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	

	ЭтаФорма.Объект.ПериодНачисления = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.ПериодНачисления), 
						ДобавитьМесяц(ЭтаФорма.Объект.ПериодНачисления, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
КонецПроцедуры

// Процедура - обробник події зміни поля Особового рахунку
//
&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	Объект.Здание = Объект.ЛицевойСчет.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере();
КонецПроцедуры

// Процедура - обробник події зміни поля Загально-будинкового лічильника
//
&НаСервере
Процедура ОбщедомовойПриборУчетаПриИзмененииНаСервере()
	ДанныеСчетчика = РасчетУслугПоТЕиГВ.ПолучитьПоказания(Объект.ОбщедомовойПриборУчета, Объект.ПериодНачисления);
	Если Объект.флДополнительныйПриборУчета Тогда
		Если ДанныеСчетчика <> Неопределено Тогда
			ДанныеДопСчетчика         = РасчетУслугПоТЕиГВ.ПолучитьПоказания(Объект.ДопПриборУчета, Объект.ПериодНачисления);
			Объект.ЗначениеОбщедомовое    = ДанныеСчетчика.КвоТЕ - ДанныеДопСчетчика.КвоКубов;
		КонецЕсли;
	Иначе
		Если ДанныеСчетчика <> Неопределено Тогда
		    Объект.ЗначениеОбщедомовое    = ДанныеСчетчика.КвоТЕ;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбщедомовойПриборУчетаПриИзменении(Элемент)
	ОбщедомовойПриборУчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УслугаСоСчетчикамиПриИзменении(Элемент)
	Объект.Услуга = Объект.УслугаСоСчетчиками;
КонецПроцедуры
